#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
module.ecs.random_id.target_group_sufix: Refreshing state... [id=m8c]
module.ecs.aws_ecr_repository.rails_terraform_app: Refreshing state... [id=rails_terraform/production]
module.ecs.aws_iam_role.ecs_execution_role: Refreshing state... [id=ecs_task_execution_role]
module.ecs.aws_cloudwatch_log_group.rails_terraform: Refreshing state... [id=rails_terraform]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-2:909067940010:cluster/dev-ecs-cluster]
module.ecs.aws_iam_role.ecs_autoscale_role: Refreshing state... [id=dev_ecs_autoscale_role]
module.networking.aws_vpc.vpc: Refreshing state... [id=vpc-0444adf7b5aeab46a]
module.ecs.aws_iam_role.ecs_role: Refreshing state... [id=ecs_role]
module.ecs.aws_iam_role_policy.ecs_execution_role_policy: Refreshing state... [id=ecs_task_execution_role:ecs_execution_role_policy]
module.ecs.aws_iam_role_policy.ecs_service_role_policy: Refreshing state... [id=ecs_role:ecs_service_role_policy]
module.ecs.aws_iam_role_policy.ecs_autoscale_role_policy: Refreshing state... [id=dev_ecs_autoscale_role:ecs_autoscale_role_policy]
module.networking.aws_security_group.default: Refreshing state... [id=sg-06fc72ec97dca2e94]
module.rds.aws_security_group.db_access_sg: Refreshing state... [id=sg-0876746b5f1a9b886]
module.ecs.aws_security_group.ecs_service: Refreshing state... [id=sg-0259d6a8e17e94e5e]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-039fd6e1b378d2eb7]
module.ecs.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:909067940010:targetgroup/dev-alb-target-group-9bc7/0d9389d82e34d420]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-0354be60bb1d5ec21]
module.ecs.aws_security_group.web_inbound_sg: Refreshing state... [id=sg-0c7764d6a0c9004da]
module.networking.aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-0e5186daf67a40d60]
module.networking.aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-0efb3126c4f50c67c]
module.networking.aws_internet_gateway.ig: Refreshing state... [id=igw-063676360172e96a1]
module.networking.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0204081b45ea3e961]
module.rds.aws_security_group.rds_sg: Refreshing state... [id=sg-0edb4cce628d4a3f0]
module.networking.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-06601fac6c000dad7]
module.networking.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-039fd6e1b378d2eb71080289494]
module.networking.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0c6160c1252acc356]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d9e65e9092065007]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e9456c49fba8e329]
module.rds.aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=dev-rds-subnet-group]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d5dc53519b4b9dc1]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-019e5049539f3c393]
module.ecs.aws_alb.alb_rails-terraform: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:909067940010:loadbalancer/app/dev-alb-rails-terraform/f016cc915a59253c]
module.networking.aws_nat_gateway.nat: Refreshing state... [id=nat-03a748be0dd0f1624]
module.rds.aws_db_instance.rds: Refreshing state... [id=dev-database]
module.networking.aws_route.private_nat_gateway: Refreshing state... [id=r-rtb-0354be60bb1d5ec211080289494]
module.ecs.aws_alb_listener.rails_terraform: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:909067940010:listener/app/dev-alb-rails-terraform/f016cc915a59253c/e5bd4153f2ec5424]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ecs.aws_alb_target_group.alb_target_group has been changed
  ~ resource "aws_alb_target_group" "alb_target_group" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-2:909067940010:targetgroup/dev-alb-target-group-9bc7/0d9389d82e34d420"
        name                               = "dev-alb-target-group-9bc7"
      + tags                               = {}
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.ecs.aws_alb_listener.rails_terraform has been changed
  ~ resource "aws_alb_listener" "rails_terraform" {
        id                = "arn:aws:elasticloadbalancing:us-east-2:909067940010:listener/app/dev-alb-rails-terraform/f016cc915a59253c/e5bd4153f2ec5424"
      + tags              = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.ecs.aws_iam_role.ecs_autoscale_role has been changed
  ~ resource "aws_iam_role" "ecs_autoscale_role" {
        id                    = "dev_ecs_autoscale_role"
        name                  = "dev_ecs_autoscale_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "ecs_autoscale_role_policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecs:DescribeServices",
                              + "ecs:UpdateService",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "*",
                            ]
                        },
                      + {
                          + Action   = [
                              + "cloudwatch:DescribeAlarms",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }
  # module.ecs.aws_ecs_cluster.cluster has been changed
  ~ resource "aws_ecs_cluster" "cluster" {
      + capacity_providers = []
        id                 = "arn:aws:ecs:us-east-2:909067940010:cluster/dev-ecs-cluster"
        name               = "dev-ecs-cluster"
      + tags               = {}
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.networking.aws_security_group.default has been changed
  ~ resource "aws_security_group" "default" {
        id                     = "sg-06fc72ec97dca2e94"
        name                   = "dev-default-sg"
      + tags                   = {}
        # (8 unchanged attributes hidden)
    }
  # module.rds.aws_db_instance.rds has been changed
  ~ resource "aws_db_instance" "rds" {
      + enabled_cloudwatch_logs_exports       = []
        id                                    = "dev-database"
        name                                  = "railsterraform_dev"
      + security_group_names                  = []
      + tags                                  = {}
        # (43 unchanged attributes hidden)
    }
  # module.rds.aws_db_subnet_group.rds_subnet_group has been changed
  ~ resource "aws_db_subnet_group" "rds_subnet_group" {
        id          = "dev-rds-subnet-group"
        name        = "dev-rds-subnet-group"
      + tags        = {}
        # (4 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.data.aws_ecs_task_definition.web will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecs_task_definition" "web"  {
      + family          = (known after apply)
      + id              = (known after apply)
      + network_mode    = (known after apply)
      + revision        = (known after apply)
      + status          = (known after apply)
      + task_definition = "dev_web"
      + task_role_arn   = (known after apply)
    }

  # module.ecs.aws_appautoscaling_policy.down will be created
  + resource "aws_appautoscaling_policy" "down" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "dev_scale_down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/dev-ecs-cluster/dev-web"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.up will be created
  + resource "aws_appautoscaling_policy" "up" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "dev_scale_up"
      + policy_type        = "StepScaling"
      + resource_id        = "service/dev-ecs-cluster/dev-web"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 1
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.target will be created
  + resource "aws_appautoscaling_target" "target" {
      + id                 = (known after apply)
      + max_capacity       = 4
      + min_capacity       = 2
      + resource_id        = "service/dev-ecs-cluster/dev-web"
      + role_arn           = "arn:aws:iam::909067940010:role/dev_ecs_autoscale_role"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.ecs.aws_cloudwatch_metric_alarm.service_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "dev_rails_terraform_web_cpu_utilization_high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "dev-ecs-cluster"
          + "ServiceName" = "dev-web"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # module.ecs.aws_ecs_service.web will be created
  + resource "aws_ecs_service" "web" {
      + cluster                            = "arn:aws:ecs:us-east-2:909067940010:cluster/dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dev-web"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "web"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:909067940010:targetgroup/dev-alb-target-group-9bc7/0d9389d82e34d420"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0259d6a8e17e94e5e",
              + "sg-06fc72ec97dca2e94",
              + "sg-0876746b5f1a9b886",
            ]
          + subnets          = [
              + "subnet-0e5186daf67a40d60",
              + "subnet-0efb3126c4f50c67c",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.db_migrate will be created
  + resource "aws_ecs_task_definition" "db_migrate" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command          = [
                      + "bundle",
                      + "exec",
                      + "rake",
                      + "db:migrate",
                    ]
                  + environment      = [
                      + {
                          + name  = "DATABASE_URL"
                          + value = "postgresql://railsterraform:myawesomepassworddev@dev-database.ctc6nktd4mh2.us-east-2.rds.amazonaws.com:5432/railsterraform_dev?encoding=utf8&pool=40"
                        },
                      + {
                          + name  = "RAILS_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "RAILS_LOG_TO_STDOUT"
                          + value = "true"
                        },
                      + {
                          + name  = "SECRET_KEY_BASE"
                          + value = "8d412aee3ceaa494fe1c276f5f7e524b9e33f649c03690e689e5b36a0cf4ce2a6f50024bc31f276c22b668e619d61a42b79f5e595759f377a8fa373e2907f41e"
                        },
                    ]
                  + image            = "909067940010.dkr.ecr.us-east-2.amazonaws.com/rails_terraform/production"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "rails_terraform"
                          + awslogs-region        = "us-east-2"
                          + awslogs-stream-prefix = "db_migrate"
                        }
                    }
                  + memory           = 300
                  + name             = "db-migrate"
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::909067940010:role/ecs_task_execution_role"
      + family                   = "dev_db_migrate"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + task_role_arn            = "arn:aws:iam::909067940010:role/ecs_task_execution_role"
    }

  # module.ecs.aws_ecs_task_definition.web will be created
  + resource "aws_ecs_task_definition" "web" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "DATABASE_URL"
                          + value = "postgresql://railsterraform:myawesomepassworddev@dev-database.ctc6nktd4mh2.us-east-2.rds.amazonaws.com:5432/railsterraform_dev?encoding=utf8&pool=40"
                        },
                      + {
                          + name  = "PORT"
                          + value = "80"
                        },
                      + {
                          + name  = "RAILS_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "RAILS_LOG_TO_STDOUT"
                          + value = "true"
                        },
                      + {
                          + name  = "RAILS_SERVE_STATIC_FILES"
                          + value = "true"
                        },
                      + {
                          + name  = "SECRET_KEY_BASE"
                          + value = "8d412aee3ceaa494fe1c276f5f7e524b9e33f649c03690e689e5b36a0cf4ce2a6f50024bc31f276c22b668e619d61a42b79f5e595759f377a8fa373e2907f41e"
                        },
                    ]
                  + image            = "909067940010.dkr.ecr.us-east-2.amazonaws.com/rails_terraform/production"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "rails_terraform"
                          + awslogs-region        = "us-east-2"
                          + awslogs-stream-prefix = "web"
                        }
                    }
                  + memory           = 300
                  + name             = "web"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::909067940010:role/ecs_task_execution_role"
      + family                   = "dev_web"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + task_role_arn            = "arn:aws:iam::909067940010:role/ecs_task_execution_role"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @bsneider, Action: `pull_request`*